       

[
    {
    "id": 649036,
    "title": "Korean Candy Chicken",
    "summary": "The recipe Korean Candy Chicken could satisfy your Korean craving in roughly <b>45 minutes</b>. This recipe serves 6. One portion of this dish contains approximately <b>57g of protein</b>, <b>9g of fat</b>, and a total of <b>672 calories</b>. For <b>$2.36 per serving</b>, this recipe <b>covers 30%</b> of your daily requirements of vitamins and minerals. 1 person has tried and liked this recipe. Head to the store and pick up sesame seeds, eggs, skinless boneless chicken breasts, and a few other things to make it today. It works well as a rather cheap main course. It is brought to you by Foodista. It is a good option if you're following a <b>dairy free</b> diet. With a spoonacular <b>score of 70%</b>, this dish is solid. Similar recipes are <a href=\"https://spoonacular.com/recipes/char-grilled-korean-style-bbq-pork-chops-and-artisan-korean-meat-giveaway-567521\">Char-grilled Korean Style BBQ Pork Chops and Artisan Korean Meat Giveaway</a>, <a href=\"https://spoonacular.com/recipes/grilled-korean-bbq-short-rib-dogs-with-sweet-peach-relish-+-spicy-korean-slaw-549399\">Grilled Korean BBQ Short Rib Dogs with Sweet Peach Relish + Spicy Korean Slaw</a>, and <a href=\"https://spoonacular.com/recipes/korean-chicken-649037\">Korean Chicken</a>."
},
{
    "id": 643832,
    "title": "Fried Xocai Healthy Chocolate Stuffed Wontons",
    "summary": "Fried Xocai Healthy Chocolate Stuffed Wontons takes around <b>45 minutes</b> from beginning to end. Watching your figure? This dairy free recipe has <b>192 calories</b>, <b>15g of protein</b>, and <b>10g of fat</b> per serving. For <b>83 cents per serving</b>, this recipe <b>covers 11%</b> of your daily requirements of vitamins and minerals. This recipe serves 6. It works well as a Chinese hor d'oeuvre. 1 person were glad they tried this recipe. Head to the store and pick up water, pepper, dark chocolate, and a few other things to make it today. It is brought to you by Foodista. With a spoonacular <b>score of 36%</b>, this dish is not so super. Similar recipes include <a href=\"https://spoonacular.com/recipes/fried-stuffed-wontons-with-healthy-dark-chocolate-643808\">Fried Stuffed Wontons with Healthy Dark Chocolate</a>, <a href=\"https://spoonacular.com/recipes/xocai-irish-cream-with-xocai-healthy-dark-chocolate-nuggets-665480\">Xocai Irish Cream with Xocai Healthy Dark Chocolate Nuggets</a>, and <a href=\"https://spoonacular.com/recipes/xocai-healthy-chocolate-muffins-631764\">Xocai Healthy Chocolate Muffins</a>."
},
{
    "id": 641897,
    "title": "Easy Chicken Piccata",
    "summary": "Easy Chicken Piccata might be a good recipe to expand your main course repertoire. One portion of this dish contains approximately <b>27g of protein</b>, <b>16g of fat</b>, and a total of <b>288 calories</b>. This recipe serves 4. For <b>$1.37 per serving</b>, this recipe <b>covers 15%</b> of your daily requirements of vitamins and minerals. It is brought to you by Foodista. 1 person has made this recipe and would make it again. A mixture of pepper, chicken stock, flour, and a handful of other ingredients are all it takes to make this recipe so flavorful. From preparation to the plate, this recipe takes roughly <b>45 minutes</b>. With a spoonacular <b>score of 42%</b>, this dish is good. If you like this recipe, you might also like recipes such as <a href=\"https://spoonacular.com/recipes/easy-chicken-piccata-692208\">Easy Chicken Piccata</a>, <a href=\"https://spoonacular.com/recipes/easy-chicken-piccata-965341\">Easy Chicken Piccata</a>, and <a href=\"https://spoonacular.com/recipes/easy-chicken-piccata-955031\">Easy Chicken Piccata</a>."
},
{
    "id": 157995,
    "title": "Curried Cracker-Coated Chicken",
    "summary": "Need a <b>dairy free main course</b>? Curried Cracker-Coated Chicken could be an amazing recipe to try. For <b>$2.62 per serving</b>, this recipe <b>covers 31%</b> of your daily requirements of vitamins and minerals. This recipe serves 2. One serving contains <b>496 calories</b>, <b>56g of protein</b>, and <b>13g of fat</b>. If you have chicken breasts, fresh cilantro, egg, and a few other ingredients on hand, you can make it. It is brought to you by spoonacular user <a href=\"/profile/coffeebean\">coffeebean</a>. From preparation to the plate, this recipe takes approximately <b>55 minutes</b>. <a href=\"https://spoonacular.com/recipes/cracker-coated-fried-perch-426242\">Cracker-Coated Fried Perch</a>, <a href=\"https://spoonacular.com/recipes/stuffing-coated-chicken-411052\">Stuffing-Coated Chicken</a>, and <a href=\"https://spoonacular.com/recipes/crumb-coated-chicken-405763\">Crumb-Coated Chicken</a> are very similar to this recipe."
},
{
    "id": 638035,
    "title": "Chicken Cordon Bleu",
    "summary": "Chicken Cordon Bleu might be a good recipe to expand your main course collection. This recipe serves 6 and costs $2.12 per serving. One serving contains <b>496 calories</b>, <b>49g of protein</b>, and <b>26g of fat</b>. This recipe from Foodista has 161 fans. Head to the store and pick up deli ham, kosher salt, swiss cheese, and a few other things to make it today. From preparation to the plate, this recipe takes around <b>45 minutes</b>. Overall, this recipe earns a <b>tremendous spoonacular score of 83%</b>. <a href=\"https://spoonacular.com/recipes/chicken-cordon-bleu-526679\">Chicken Cordon Bleu</a>, <a href=\"https://spoonacular.com/recipes/chicken-cordon-bleu-808523\">Chicken Cordon Bleu</a>, and <a href=\"https://spoonacular.com/recipes/chicken-cordon-bleu-74258\">Chicken Cordon Bleu</a> are very similar to this recipe."
},
{
    "id": 641836,
    "title": "Easy Baked Parmesan Chicken",
    "summary": "You can never have too many main course recipes, so give Easy Baked Parmesan Chicken a try. This recipe makes 4 servings with <b>598 calories</b>, <b>67g of protein</b>, and <b>18g of fat</b> each. For <b>$3.51 per serving</b>, this recipe <b>covers 38%</b> of your daily requirements of vitamins and minerals. If you have pasta sauce, shredded mozzarella cheese, skinless boneless chicken breast halves, and a few other ingredients on hand, you can make it. It is brought to you by Foodista. 92 people have tried and liked this recipe. From preparation to the plate, this recipe takes around <b>45 minutes</b>. Taking all factors into account, this recipe <b>earns a spoonacular score of 93%</b>, which is excellent. Try <a href=\"https://spoonacular.com/recipes/easy-parmesan-baked-chicken-137192\">Easy Parmesan Baked Chicken</a>, <a href=\"https://spoonacular.com/recipes/weight-watchers-easy-healthy-baked-chicken-parmesan-525488\">Weight Watchers Easy Healthy Baked Chicken Parmesan</a>, and <a href=\"https://spoonacular.com/recipes/easy-baked-eggplant-parmesan-24018\">Easy Baked Eggplant Parmesan</a> for similar recipes."
},
{
    "id": 641896,
    "title": "Easy Chicken Cordon Bleu",
    "summary": "Easy Chicken Cordon Bleu takes around <b>45 minutes</b> from beginning to end. For <b>23 cents per serving</b>, this recipe <b>covers 4%</b> of your daily requirements of vitamins and minerals. One portion of this dish contains around <b>6g of protein</b>, <b>6g of fat</b>, and a total of <b>114 calories</b>. This recipe serves 8. A mixture of salt, skinless boneless chicken breast, ham, and a handful of other ingredients are all it takes to make this recipe so flavorful. This recipe is liked by 21 foodies and cooks. It is brought to you by Foodista. Overall, this recipe earns a <b>not so excellent spoonacular score of 15%</b>. Similar recipes include <a href=\"https://spoonacular.com/recipes/easy-chicken-cordon-bleu-826643\">Easy Chicken Cordon Bleu</a>, <a href=\"https://spoonacular.com/recipes/easy-chicken-cordon-bleu-74367\">Easy Chicken Cordon Bleu</a>, and <a href=\"https://spoonacular.com/recipes/easy-chicken-cordon-bleu-489149\">Easy Chicken Cordon Bleu</a>."
},
{
    "id": 635992,
    "title": "Breaded Chicken Fingers",
    "summary": "Breaded Chicken Fingers takes about <b>45 minutes</b> from beginning to end. This recipe makes 1 servings with <b>2755 calories</b>, <b>188g of protein</b>, and <b>132g of fat</b> each. For <b>$10.12 per serving</b>, this recipe <b>covers 72%</b> of your daily requirements of vitamins and minerals. It works well as a pricey main course. 1 person found this recipe to be scrumptious and satisfying. A mixture of baking powder, skinless boneless chicken breast halves, garlic powder, and a handful of other ingredients are all it takes to make this recipe so flavorful. It is brought to you by Foodista. Overall, this recipe earns an <b>outstanding spoonacular score of 88%</b>. Similar recipes include <a href=\"https://spoonacular.com/recipes/breaded-zucchini-fingers-106052\">Breaded Zucchini Fingers</a>, <a href=\"https://spoonacular.com/recipes/chicken-spinoccoli-breaded-stuffed-chicken-breast-with-spinach-broccoli-and-cheese-485365\">Chicken Spinoccoli – Breaded Stuffed Chicken Breast With Spinach, Broccoli and Cheese</a>, and <a href=\"https://spoonacular.com/recipes/breaded-chicken-with-tomatoes-164614\">Breaded Chicken with Tomatoes</a>."
},
{
    "id": 640518,
    "title": "Cream Corn & Chicken Soup",
    "summary": "Cream Corn & Chicken Soup might be a good recipe to expand your main course repertoire. Watching your figure? This gluten free and dairy free recipe has <b>409 calories</b>, <b>33g of protein</b>, and <b>21g of fat</b> per serving. This recipe serves 4. For <b>$2.47 per serving</b>, this recipe <b>covers 20%</b> of your daily requirements of vitamins and minerals. A mixture of chicken breasts, salt and pepper, water, and a handful of other ingredients are all it takes to make this recipe so delicious. 1 person were impressed by this recipe. It will be a hit at your <b>Autumn</b> event. It is brought to you by Foodista. From preparation to the plate, this recipe takes around <b>45 minutes</b>. With a spoonacular <b>score of 53%</b>, this dish is solid. Similar recipes are <a href=\"https://spoonacular.com/recipes/cream-of-corn-soup-147532\">Cream of Corn Soup</a>, <a href=\"https://spoonacular.com/recipes/cream-of-roasted-red-bell-pepper-soup-with-roasted-sweet-corn-and-cilantro-lime-sour-cream-739899\">Cream of Roasted Red Bell Pepper Soup with Roasted Sweet Corn and Cilantro- Lime Sour Cream</a>, and <a href=\"https://spoonacular.com/recipes/cream-of-shiitake-and-corn-soup-116533\">Cream of Shiitake and Corn Soup</a>."
},
{
    "id": 640836,
    "title": "Crispy Santa Fe Chicken",
    "summary": "You can never have too many side dish recipes, so give Crispy Santa Fe Chicken a try. One portion of this dish contains roughly <b>10g of protein</b>, <b>16g of fat</b>, and a total of <b>224 calories</b>. This recipe serves 4 and costs 95 cents per serving. 1 person found this recipe to be tasty and satisfying. If you have saltines, shredded mexican cheese blend, salsa, and a few other ingredients on hand, you can make it. From preparation to the plate, this recipe takes around <b>45 minutes</b>. It is brought to you by Foodista. With a spoonacular <b>score of 20%</b>, this dish is rather bad. Similar recipes include <a href=\"https://spoonacular.com/recipes/crispy-santa-fe-chicken-264586\">Crispy Santa Fe Chicken</a>, <a href=\"https://spoonacular.com/recipes/santa-fe-nm-jalapeno-margarita-hotel-santa-fe-521905\">Santa Fe NM: Jalapeno Margarita {} & Hotel Santa Fe</a>, and <a href=\"https://spoonacular.com/recipes/santa-fe-chicken-416943\">Santa Fe Chicken</a>."
}

]